## Exercises - Basic SQL Queries

### Exercise 1 - Customer order count¶
Get order count per customer for the month of 2014 January.

Tables - orders and customers

Data should be sorted in descending order by count and ascending order by customer id.

Output should contain customer_id, customer_first_name, customer_last_name and customer_order_count.

In [1]:
##load connection 
%load_ext sql

In [2]:
##database 
%env DATABASE_URL=postgresql://mako:mako@pg.itversity.com:5432/mako

env: DATABASE_URL=postgresql://mako:mako@pg.itversity.com:5432/mako

In [3]:
%%sql

SELECT c.customer_id, 
    c.customer_fname, 
    c.customer_lname,
    count(o.order_id) AS customer_order_count 
FROM orders o JOIN customers c 
    ON o.order_customer_id = c.customer_id
WHERE to_char(o.order_date, 'yyyy-MM') = '2014-01'
GROUP BY c.customer_id
ORDER BY customer_order_count DESC, c.customer_id
LIMIT 10;

10 rows affected.

[(8622, 'Shirley', 'Smith', 5),
 (9676, 'Theresa', 'Smith', 5),
 (7, 'Melissa', 'Wilcox', 4),
 (222, 'Frank', 'Ruiz', 4),
 (2444, 'Kenneth', 'Smith', 4),
 (2485, 'Mary', 'Hernandez', 4),
 (2555, 'Mary', 'Long', 4),
 (3128, 'Karen', 'Turner', 4),
 (3199, 'Ashley', 'Hernandez', 4),
 (3610, 'Jordan', 'Smith', 4)]

### Exercise 2 – Dormant Customers¶
Get the customer details who have not placed any order for the month of 2014 January.

Tables – orders and customers
Data should be sorted in ascending order by customer_id
Output should contain all the fields from customers

In [4]:
%%sql

SELECT count(1) FROM customers

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(12435,)]

In [5]:
%%sql

select c.* 
FROM customers c LEFT OUTER JOIN 
    (SELECT DISTINCT order_customer_id 
     FROM orders WHERE
     to_char(order_date, 'yyyy-MM') = '2014-01'
    ) o
    ON c.customer_id = o.order_customer_id
WHERE  o.order_customer_id IS NULL 
ORDER BY c.customer_id
LIMIT 10

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(1, 'Richard', 'Hernandez', 'XXXXXXXXX', 'XXXXXXXXX', '6303 Heather Plaza', 'Brownsville', 'TX', '78521'),
 (2, 'Mary', 'Barrett', 'XXXXXXXXX', 'XXXXXXXXX', '9526 Noble Embers Ridge', 'Littleton', 'CO', '80126'),
 (3, 'Ann', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '3422 Blue Pioneer Bend', 'Caguas', 'PR', '00725'),
 (4, 'Mary', 'Jones', 'XXXXXXXXX', 'XXXXXXXXX', '8324 Little Common', 'San Marcos', 'CA', '92069'),
 (5, 'Robert', 'Hudson', 'XXXXXXXXX', 'XXXXXXXXX', '10 Crystal River Mall ', 'Caguas', 'PR', '00725'),
 (6, 'Mary', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '3151 Sleepy Quail Promenade', 'Passaic', 'NJ', '07055'),
 (9, 'Mary', 'Perez', 'XXXXXXXXX', 'XXXXXXXXX', '3616 Quaking Street', 'Caguas', 'PR', '00725'),
 (10, 'Melissa', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '8598 Harvest Beacon Plaza', 'Stafford', 'VA', '22554'),
 (11, 'Mary', 'Huffman', 'XXXXXXXXX', 'XXXXXXXXX', '3169 Stony Woods', 'Caguas', 'PR', '00725'),
 (12, 'Christopher', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '5594 Jagged Embers By-pass', 'San Antonio', 'TX', '78227')]

In [6]:
%%sql

select count(1)
FROM customers c LEFT OUTER JOIN 
    (SELECT DISTINCT order_customer_id 
     FROM orders WHERE
     to_char(order_date, 'yyyy-MM') = '2014-01'
    ) o
    ON c.customer_id = o.order_customer_id
WHERE  o.order_customer_id IS NULL

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(7739,)]

In [7]:
%%sql

SELECT c.*
FROM customers c LEFT OUTER JOIN ORDERS o
    ON c.customer_id = o.order_customer_id
        AND to_char(o.order_date, 'yyyy-MM') = '2014-01'
WHERE o.order_customer_id IS NULL
LIMIT 10;

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(10951, 'Austin', 'Weiss', 'XXXXXXXXX', 'XXXXXXXXX', '5737 Honey Meadow', 'Caguas', 'PR', '00725'),
 (10953, 'Kevin', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '8341 Stony Avenue', 'Caguas', 'PR', '00725'),
 (10954, 'Mary', 'White', 'XXXXXXXXX', 'XXXXXXXXX', '8957 Old View View', 'Las Vegas', 'NV', '89119'),
 (10956, 'Mary', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '4927 Hidden Limits', 'Caguas', 'PR', '00725'),
 (10958, 'Joan', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '8771 Middle Quail Heath', 'Los Angeles', 'CA', '90024'),
 (10960, 'Danielle', 'Browning', 'XXXXXXXXX', 'XXXXXXXXX', '7580 Velvet Lagoon Extension', 'Van Nuys', 'CA', '91405'),
 (10963, 'Amber', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '654 Foggy Point', 'Meridian', 'ID', '83642'),
 (10965, 'Robert', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '2704 Colonial Barn Nook', 'Caguas', 'PR', '00725'),
 (10966, 'Martha', 'Pierce', 'XXXXXXXXX', 'XXXXXXXXX', '6797 Quiet Mountain Rise', 'Plymouth', 'MA', '02360'),
 (10967, 'Alexander', 'Cunningham', 'XXXXXXXXX', 'XXXXXXXXX', '7373 Pleasant Estates', 'Caguas', 'PR', '00725')]

In [8]:
%%sql

SELECT count(1)
FROM customers c LEFT OUTER JOIN ORDERS o
    ON c.customer_id = o.order_customer_id
        AND to_char(o.order_date, 'yyyy-MM') = '2014-01'
WHERE o.order_customer_id IS NULL

 * postgresql://mako:***@pg.itversity.com:5432/mako
1 rows affected.

[(7739,)]

#### Exercise 3 – Revenue Per Customer¶
Get the revenue generated by each customer for the month of 2014 January

Tables – orders, order_items and customers
Data should be sorted in descending order by revenue and then ascending order by customer_id
Output should contain customer_id, customer_first_name, customer_last_name, customer_revenue.
If there are no orders placed by customer, then the corresponding revenue for a given customer should be 0.
Consider only COMPLETE and CLOSED orders

In [9]:
%%sql

SELECT c.customer_id, c.customer_fname, c.customer_lname, 
    CASE 
        WHEN SUM(oi.order_item_subtotal::numeric) IS NULL 
            THEN 0 
        ELSE SUM(oi.order_item_subtotal::numeric)
    END AS customer_revenue 
FROM customers c 
    LEFT OUTER JOIN orders o 
        ON c.customer_id = o.order_customer_id 
    LEFT OUTER JOIN order_items oi 
        ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED') 
    AND to_char(o.order_date, 'yyyy-MM') = '2014-01'
GROUP BY c.customer_id
ORDER BY customer_revenue DESC, c.customer_id
LIMIT 10;

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(2555, 'Mary', 'Long', Decimal('2954.63')),
 (3465, 'Mary', 'Gardner', Decimal('2929.74')),
 (3710, 'Ashley', 'Smith', Decimal('2739.82')),
 (1780, 'Larry', 'Sharp', Decimal('2689.65')),
 (986, 'Catherine', 'Hawkins', Decimal('2629.90')),
 (9676, 'Theresa', 'Smith', Decimal('2599.84')),
 (1847, 'Mary', 'Smith', Decimal('2589.87')),
 (11901, 'Mary', 'Smith', Decimal('2469.87')),
 (4618, 'Andrea', 'Smith', Decimal('2429.82')),
 (10896, 'Victoria', 'Smith', Decimal('2419.78'))]

#### Exercise 4 – Revenue Per Category¶
Get the revenue generated for each category for the month of 2014 January

Tables – orders, order_items, products and categories
Data should be sorted in ascending order by category_id.
Output should contain all the fields from category along with the revenue as category_revenue.
Consider only COMPLETE and CLOSED orders

In [10]:
%%sql

SELECT c.*, 
    round(sum(oi.order_item_subtotal)::numeric, 2) AS category_revenue 
FROM categories c JOIN products p 
        ON c.category_id = p.product_category_id 
    JOIN order_items oi 
        ON p.product_id = oi.order_item_product_id 
    JOIN orders o
        ON oi.order_item_order_id = o.order_id
WHERE to_char(o.order_date, 'yyyy-MM') = '2014-01' 
    AND o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY c.category_id
ORDER BY c.category_id 
LIMIT 10;

 * postgresql://mako:***@pg.itversity.com:5432/mako
10 rows affected.

[(2, 2, 'Soccer', Decimal('1094.88')),
 (3, 2, 'Baseball & Softball', Decimal('3214.41')),
 (4, 2, 'Basketball', Decimal('1299.98')),
 (5, 2, 'Lacrosse', Decimal('1299.69')),
 (6, 2, 'Tennis & Racquet', Decimal('1124.75')),
 (7, 2, 'Hockey', Decimal('1433.00')),
 (9, 3, 'Cardio Equipment', Decimal('133156.77')),
 (10, 3, 'Strength Training', Decimal('3388.96')),
 (11, 3, 'Fitness Accessories', Decimal('1509.73')),
 (12, 3, 'Boxing & MMA', Decimal('3998.46'))]

#### Exercise 5 – Product Count Per Department¶
Get the products for each department.

Tables – departments, categories, products
Data should be sorted in ascending order by department_id
Output should contain all the fields from department and the product count as product_count

In [12]:
%%sql

SELECT d.*, 
    count(p.product_id) AS product_count 
FROM departments d 
    JOIN categories c 
        ON d.department_id = c.category_department_id 
    JOIN products p
        ON c.category_id = p.product_category_id
GROUP BY d.department_id
ORDER BY d.department_id;

 * postgresql://mako:***@pg.itversity.com:5432/mako
6 rows affected.

[(2, 'Fitness', 168),
 (3, 'Footwear', 168),
 (4, 'Apparel', 140),
 (5, 'Golf', 120),
 (6, 'Outdoors', 336),
 (7, 'Fan Shop', 149)]